'use strict';

module.exports.mockData = [
  {
    "id": `G-MV219wCe`,
    "title": `Куплю детские санки.`,
    "picture": `item02.jpg`,
    "description": `Доставлю по городу или отправлю почтой. Бонусом отдам все аксессуары. Служил верой и правдой.`,
    "type": `OFFER`,
    "sum": 60378,
    "categories": [
      `Антиквариат`,
      `Игры`,
      `Животные`,
      `Посуда`,
      `Журналы`,
      `Телевизоры`,
      `Разное`,
      `Бытовая техника`
    ],
    "comments": [
      {"id": `75s-s55nUo`, "text": `А где блок питания?`},
      {
        "id": `vdMg9JfOTb`,
        "text": `С чем связана продажа? Почему так дешёво? Совсем немного... Неплохо, но дорого.`
      }
    ]
  },
  {
    "id": `gRhRLa7RQ5`,
    "title": `Продам старый телевизор.`,
    "picture": `item16.jpg`,
    "description": `Таких предложений больше нет! Продаю с болью в сердце... Две страницы заляпаны свежим кофе.`,
    "type": `OFFER`,
    "sum": 48080,
    "categories": [
      `Электроника`,
      `Спорт`,
      `Разное`,
      `Животные`,
      `Посуда`,
      `Телефоны`,
      `Одежда`,
      `Антиквариат`,
      `Книги`,
      `Телевизоры`,
      `Бытовая техника`
    ],
    "comments": [
      {
        "id": `A1acPdJpM-`,
        "text": `А где блок питания? Почему в таком ужасном состоянии?`
      },
      {
        "id": `f3-A-ZhCQ4`,
        "text": `С чем связана продажа? Почему так дешёво? Неплохо, но дорого.`
      }
    ]
  }
];
