'use strict';

module.exports = {
  mockData: [
    {
      "title": `Продам отличную подборку фильмов на VHS.`,
      "date": `2021-08-21T21:19:10+03:00`,
      "picture": `item10.jpg`,
      "description": `Продаю лучшего друга! Даю недельную гарантию. Служил верой и правдой.`,
      "type": `SALE`,
      "sum": 92294,
      "categories": [
        `Посуда`,
        `Разное`
      ],
      "comments": [
        {
          "text": `С чем связана продажа? Почему так дешёво? Оплата наличными или перевод на карту? Неплохо, но дорого.`
        },
        {
          "text": `Почему в таком ужасном состоянии? А сколько игр в комплекте? Вы что?! В магазине дешевле.`
        }
      ]
    },
    {
      "title": `Куплю породистого кота.`,
      "date": `2021-08-21T21:19:10+03:00`,
      "picture": `item14.jpg`,
      "description": `Не пытайтесь торговаться. Цену вещам я знаю. Продаю лучшего друга! Бонусом отдам все аксессуары.`,
      "type": `OFFER`,
      "sum": 14797,
      "categories": [
        `Телефоны`,
        `Животные`,
      ],
      "comments": [
        {
          "text": `Неплохо, но дорого. А где блок питания? С чем связана продажа? Почему так дешёво?`
        },
        {
          "text": `Почему в таком ужасном состоянии? С чем связана продажа? Почему так дешёво? Вы что?! В магазине дешевле.`
        },
        {
          "text": `Вы что?! В магазине дешевле. Неплохо, но дорого. Продаю в связи с переездом. Отрываю от сердца.`
        }
      ]
    },
    {
      "title": `Куплю зимнюю резину.`,
      "date": `2021-08-21T21:19:10+03:00`,
      "picture": `item03.jpg`,
      "description": `Кажется, что это хрупкая вещь. Доставлю по городу или отправлю почтой. Продаю лучшего друга!`,
      "type": `SALE`,
      "sum": 85840,
      "categories": [
        `Игры`,
        `Журналы`
      ],
      "comments": [
        {
          "text": `А сколько игр в комплекте? Оплата наличными или перевод на карту?`
        }
      ]
    }
  ],
  mockCategories: [
    `Животные`,
    `Журналы`,
    `Игры`,
    `Телефоны`,
    `Посуда`,
    `Разное`
  ],
};
