'use strict';

module.exports.mockData = [
  {
    "id": `3srtvBPi7c`,
    "title": `Продам отличную подборку фильмов на VHS.`,
    "picture": `item10.jpg`,
    "description": `Продаю лучшего друга! Даю недельную гарантию. Служил верой и правдой.`,
    "type": `SALE`,
    "sum": 92294,
    "categories": [
      `Бытовая техника`,
      `Посуда`,
      `Игры`,
      `Журналы`,
      `Электроника`,
      `Телефоны`,
      `Разное`,
      `Спорт`,
      `Животные`,
      `Одежда`,
      `Антиквариат`
    ],
    "comments": [
      {
        "id": `E4qZ4P8nKm`,
        "text": `С чем связана продажа? Почему так дешёво? Оплата наличными или перевод на карту? Неплохо, но дорого.`
      },
      {
        "id": `nJH6SjfWFQ`,
        "text": `Почему в таком ужасном состоянии? А сколько игр в комплекте? Вы что?! В магазине дешевле.`
      }
    ]
  },
  {
    "id": `BcjEfuMRd-`,
    "title": `Куплю породистого кота.`,
    "picture": `item14.jpg`,
    "description": `Не пытайтесь торговаться. Цену вещам я знаю. Продаю лучшего друга! Бонусом отдам все аксессуары.`,
    "type": `OFFER`,
    "sum": 14797,
    "categories": [
      `Антиквариат`,
      `Одежда`,
      `Телефоны`,
      `Животные`,
      `Посуда`,
      `Разное`,
      `Книги`,
      `Электроника`,
      `Игры`
    ],
    "comments": [
      {
        "id": `kbotzyeXHK`,
        "text": `Неплохо, но дорого. А где блок питания? С чем связана продажа? Почему так дешёво?`
      },
      {
        "id": `YM6D9FLFaa`,
        "text": `Почему в таком ужасном состоянии? С чем связана продажа? Почему так дешёво? Вы что?! В магазине дешевле.`
      },
      {
        "id": `8Cxw_930vM`,
        "text": `Вы что?! В магазине дешевле. Неплохо, но дорого. Продаю в связи с переездом. Отрываю от сердца.`
      }
    ]
  },
  {
    "id": `at9sSlwPLF`,
    "title": `Куплю зимнюю резину.`,
    "picture": `item03.jpg`,
    "description": `Кажется, что это хрупкая вещь. Доставлю по городу или отправлю почтой. Продаю лучшего друга!`,
    "type": `SALE`,
    "sum": 85840,
    "categories": [
      `Разное`,
      `Бытовая техника`,
      `Электроника`,
      `Игры`,
      `Журналы`
    ],
    "comments": [
      {
        "id": `a4MhSI_OQy`,
        "text": `А сколько игр в комплекте? Оплата наличными или перевод на карту?`
      }
    ]
  }
];
